In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('marks.csv')

In [3]:
data

    name  college_id  duration  marks  time_before_college  caff  semester
0   abhi           1         2     40                   10   100         1
1   eric           1         4     50                   20   200         2
2   jack           1         2      5                    5   400         3
3   amit           1         2     50                   10    10         1
4  krish           1         4     60                   20   100         2

In [5]:
data.corr()

,college_id,duration,marks,time_before_college,caff,semester
college_id,NaN,NaN,NaN,NaN,NaN,NaN
duration,NaN,1.000000,0.599145,0.952579,-0.073488,0.218218
marks,NaN,0.599145,1.000000,0.803685,-0.842077,-0.616365
time_before_college,NaN,0.952579,0.803685,1.000000,-0.357518,-0.089087
caff,NaN,-0.073488,-0.842077,-0.357518,1.000000,0.906061
semester,NaN,0.218218,-0.616365,-0.089087,0.906061,1.000000

In [8]:
data.columns

Index(['name', 'college_id', 'duration', 'marks', 'time_before_college',
       'caff', 'semester'],
      dtype='object')

In [9]:
x = data[['duration', 'time_before_college', 'caff']]

In [10]:
x

   duration  time_before_college  caff
0         2                   10   100
1         4                   20   200
2         2                    5   400
3         2                   10    10
4         4                   20   100

In [11]:
y = data['marks']

In [12]:
y

0    40
1    50
2     5
3    50
4    60
Name: marks, dtype: int64

In [13]:
from sklearn.linear_model import LinearRegression

In [14]:
model = LinearRegression()

In [15]:
model.fit(x,y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [18]:
# 3 is duration
# 40 is time_before_college
# 100 is caff
model.predict([[3,40,100]])

array([69.18508287])

In [23]:
weight = model.coef_

In [24]:
weight
# THESE ARE CALLED WEIGHTS.
# increase 1 in duartion increases marks by 6
# increase 1 in time_before_college increases marks by 0.75
# increase 1 in caff decrease marks by 0.105

array([ 6.20165746,  0.75690608, -0.10497238])